; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-1-3-5-168)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p3-0 - location
	p3-5 - location
	p4-0 - location
	p4-3 - location
	p4-5 - location
	p2-1 - location
	p5-1 - location
	p5-2 - location
	p0-2 - location
	p0-5 - location
	)
	(:init
	(at driver1 s0)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s4)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s5)
	(at package2 s0)
	(at package3 s5)
	(at package4 s4)
	(at package5 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 12)
	(= (time-to-walk p3-0 s3) 12)
	(= (time-to-walk s0 p3-0) 22)
	(= (time-to-walk p3-0 s0) 22)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 44)
	(= (time-to-walk p3-5 s3) 44)
	(= (time-to-walk s5 p3-5) 7)
	(= (time-to-walk p3-5 s5) 7)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 43)
	(= (time-to-walk p4-0 s4) 43)
	(= (time-to-walk s0 p4-0) 43)
	(= (time-to-walk p4-0 s0) 43)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 26)
	(= (time-to-walk p4-3 s4) 26)
	(= (time-to-walk s3 p4-3) 6)
	(= (time-to-walk p4-3 s3) 6)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 30)
	(= (time-to-walk p4-5 s4) 30)
	(= (time-to-walk s5 p4-5) 23)
	(= (time-to-walk p4-5 s5) 23)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 34)
	(= (time-to-walk p2-1 s2) 34)
	(= (time-to-walk s1 p2-1) 43)
	(= (time-to-walk p2-1 s1) 43)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 30)
	(= (time-to-walk p5-1 s5) 30)
	(= (time-to-walk s1 p5-1) 16)
	(= (time-to-walk p5-1 s1) 16)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 18)
	(= (time-to-walk p5-2 s5) 18)
	(= (time-to-walk s2 p5-2) 4)
	(= (time-to-walk p5-2 s2) 4)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 1)
	(= (time-to-walk p0-2 s0) 1)
	(= (time-to-walk s2 p0-2) 16)
	(= (time-to-walk p0-2 s2) 16)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 13)
	(= (time-to-walk p0-5 s0) 13)
	(= (time-to-walk s5 p0-5) 3)
	(= (time-to-walk p0-5 s5) 3)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 47)
	(= (time-to-drive s2 s5) 47)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 25)
	(= (time-to-drive s0 s1) 25)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 10)
	(= (time-to-drive s4 s1) 10)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 25)
	(= (time-to-drive s5 s1) 25)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 20)
	(= (time-to-drive s0 s4) 20)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 41)
	(= (time-to-drive s5 s4) 41)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 16)
	(= (time-to-drive s4 s3) 16)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 35)
	(= (time-to-drive s5 s3) 35)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 38)
	(= (time-to-drive s2 s0) 38)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 27)
	(= (time-to-drive s5 s0) 27)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 43)
	(= (time-to-drive s1 s2) 43)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 7)
	(= (time-to-drive s3 s2) 7)
	(= (fuel-used) 0)
)
	(:goal (and
	(at truck2 s4)
	(at truck3 s2)
	(at package1 s1)
	(at package2 s0)
	(at package3 s4)
	(at package4 s1)
	(at package5 s0)
	))

(:metric minimize (+ (* 3 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver1 s0 p4-0)
   deleted: (at driver1 s0)
   added: (at driver1 p4-0)
   goals met: 1 of 7
2. (walk driver1 p4-0 s4)
   deleted: (at driver1 p4-0)
   added: (at driver1 s4)
   goals met: 1 of 7
3. (walk driver1 s4 p4-3)
   deleted: (at driver1 s4)
   added: (at driver1 p4-3)
   goals met: 1 of 7
4. (walk driver1 p4-3 s3)
   deleted: (at driver1 p4-3)
   added: (at driver1 s3)
   goals met: 1 of 7
5. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 7
6. (drive-truck truck2 s3 s4 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (fuel-used) from 0 to 160
   goals met: 2 of 7
7. (load-truck package4 truck2 s4)
   deleted: (at package4 s4)
   added: (in package4 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 7
8. (load-truck package5 truck2 s4)
   deleted: (at package5 s4)
   added: (in package5 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 2 of 7
9. (drive-truck truck2 s4 s1 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 160 to 290
   goals met: 1 of 7
10. (unload-truck package4 truck2 s1)
   deleted: (in package4 truck2)
   added: (at package4 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 2 of 7
11. (drive-truck truck2 s1 s0 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 290 to 565
   goals met: 2 of 7
12. (unload-truck package5 truck2 s0)
   deleted: (in package5 truck2)
   added: (at package5 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 3 of 7
13. (drive-truck truck2 s0 s4 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 565 to 765
   goals met: 4 of 7
14. (disembark-truck driver1 truck2 s4)
   deleted: (driving driver1 truck2)
   added: (at driver1 s4) (empty truck2)
   goals met: 4 of 7
15. (board-truck driver1 truck3 s4)
   deleted: (at driver1 s4) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 7
16. (drive-truck truck3 s4 s5 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 765 to 1175
   goals met: 4 of 7
17. (load-truck package1 truck3 s5)
   deleted: (at package1 s5)
   added: (in package1 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 4 of 7
18. (load-truck package3 truck3 s5)
   deleted: (at package3 s5)
   added: (in package3 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 4 of 7
19. (drive-truck truck3 s5 s1 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (fuel-used) from 1175 to 1500
   goals met: 4 of 7
20. (unload-truck package1 truck3 s1)
   deleted: (in package1 truck3)
   added: (at package1 s1)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 5 of 7
21. (drive-truck truck3 s1 s4 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (fuel-used) from 1500 to 1610
   goals met: 5 of 7
22. (unload-truck package3 truck3 s4)
   deleted: (in package3 truck3)
   added: (at package3 s4)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 6 of 7
23. (drive-truck truck3 s4 s0 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (fuel-used) from 1610 to 1810
   goals met: 6 of 7
24. (drive-truck truck3 s0 s2 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 1810 to 2190
   goals met: 7 of 7
